{"1999": "Sisters, Brothers and Dear Children,  Accept my greetings on the sacred occasion of Independence Day. This is a day of hallowed remembrance for us. This is a day of dedication for us.  This year's Independence Day has special significance for all of us. The present century is coming to an end. The world will have entered the next century by the time of the next Independence Day.  As we stand at the sunset of the 20th century, and look back at the events of the era that has passed, we see the end of colonialism from Indian soil to be the most important development. Our great leaders, and many generations of our countrymen, waged a powerful struggle for independence. By doing so, they paved the way for the independence of other countries, too.  We pay our homage to those self-sacrificing and devoted leaders and patriots who struggled for freedom throughout their lives, and, when necessary, even laid down their lives as aahuti (offering) in the great yagya of freedom.  Come, all my countrymen, let us strive to become worthy heirs to those great leaders. We dedicate today's sacred day to their memory.  In the same way, I offer my condolences to the valiant jawans, officers and others belonging to the Army and the Air Force, who displayed magnificent heroism and the spirit of sacrifice in recapturing that part of our Motherland in Kargil from the enemy. All of us bow our heads in gratitude for those who were martyred in the Kargil war.  Almost all our countrymen have seen on television glimpses of the impossible summits, which our heroes overcame and pushed out the enemy. To gain victory at such heights is not only to surmount the sky-piercing peaks, it displays the full might of the nation. It is a symbol of the bravery of our Armed Forces.  How can we forget such heroes?  How can we forget those wounded soldiers whose only wish was: how can we get well and rejoin our battalion to repulse the enemy?  How can we forget the members of the families of those brave martyrs, who, on receiving the body of their beloved, said, ~We do not have tears in our eyes, we have pride in our heart~?  How can we forget the mother whose lament was that she had had only one son, and therefore, could not send another to fight for our country?  I know that mere words of solace are not enough. We have to take concrete measures for the families of the martyrs and wounded soldiers so that they may live a life of comfort and dignity.  It has been said that we remembers and honour soldiers during a war, and in the immediate aftermath. But as the days pass, we forget them. And it is a sad fact that many who sacrificed their life and limb in previous wars were often forgotten. I give you my personal pledge that this will not happen again.  The Red Fort and its world-renowned ramparts are not merely a geographical spot. The very heartbeat of India's freedom struggle is linked to this fort and its ramparts. In the First War of Independence of 1857, this is where Bahadur Shah Zafar was held a prisoner.  Netaji Subhash Chandra Bose made this very fort the target of his campaign in 1943 and, blowing the bugle of Independence, gave the stirring call to his countrymen: ~Dilli Chalo, Chalo Lal Kile~  It is from this very fort that our first Prime Minister, Pandit Jawaharlal Nehru hoisted for the first time, the tricolour of Free India in 1947.  More than half a century has passed. Today, we stand at the threshold of a new era.  Come, let us enter this new era united in step and united in resolve.  When I addressed you from this rampart last year, there was uncertainty and cynicism in the atmosphere. I was being asked:  Will we be able to withstand economic sanctions?  To what extent will we be able to ward off the economic crisis, which had struck the Tiger Economies of Southeast Asia?  Will the Government be allowed to carry on its work?  Today, speaking to a self-confident India, I declare:  Sanctions have lost their effect. They have become a thing of the past. We have dealt with them in such a way that they hardly had any effect on our economy.  We kept the South-east Asian economic crisis at bay;  Yes, the Government was brought down, but the country was not. It continued to march ahead, fulfilling the mantra of Charaiveti, Charaiveti (Move on, Move on). The Government continued to discharge its duty.  Most important, a war was imposed on us.  We have not just triumphed over difficulties, we have achieved much. In spite of obstacles that were put in our way,  Our National Income has grown by 6 percent;  Having crossed 200 million tonnes, production of foodgrains is higher today than ever before;  Food stocks are higher today than ever. For this our kisans deserve our felicitations. Our agricultural scientists are also worthy of our praise.  Industrial production is reviving at an energetic pace;  The new initiatives which have been taken in infrastructure have infused a new purposefulness right across the economy;  At over 30 billion dollars our foreign exchange reserves are higher than ever before;  The Sensex in the stock market has risen to record levels. In spite of Kargil, our companies have been able to increase their market value by over Rs. 200,000 crore.  The off-take of cement for building houses is 22 percent higher than it has ever been; Facilities which were known only to the rich, to the few, and in our cities alone - insurance for their output, credit cards - are now available to, and are being taken advantage of by farmers and by others in our far-flung villages.  And we are stronger than ever. Pokharan has given us enviable strength and self-confidence AGNI-2 has been tested - in the face of pressure - and will be integrated into our defence arsenal.  PSLV and INSAT 2- E have been launched. What a feat our scientists have accomplished: sending not just one, but three satellites on a single rocket far out into space, and placing each of them at the precise point in space, which had been fixed. This has been a magnificent achievement.  Yes, one thing has certainly come down. It is the rate of inflation. At 1.3 percent, this is the lowest rate in seventeen years.  There has also been a sea change in the way the world sees us. Last year we had taken a major step - Pokhran 2- which was essential for our security, a step which had been contemplated for long but which could not be taken because of the pressures which were put on successive governments.  Some did not agree with our assessment. Some even sought to portray us as an irresponsible nation. However today, within a year, in the councils of the world, ~India~ is synonymous with ~responsibility~  The world has seen that we will protect our national interest at all costs: whether it is in developing an atomic weapons capability, whether it is in developing missile - capability, whether it is in driving adversaries out of our land:  The world has seen that we will withstand all pressures that we will withstand all pressures that are intended to keep us from taking the measures that we consider necessary in our national interest;  Also the world has seen that whatever we do, will be for self-defence, never for aggression.  But the world has also seen that we are capable of doing so with utmost restraint, with utmost responsibility. These were the principles, which guided us when Pakistan forced the Kargil war on us. Our response was well thought out. It was so effective that it left the enemy stunned.  The world today has well realized that we would do whatever is required to protect our country.  The world has also understood that we would act with utmost responsibility and restraint even when so gravely provoked. This has raised the reputation of India in the international community.  The Lahore bus journey was taken to improve our relations with Pakistan. This made the world realize that we truly want peace and friendship. This journey was not a showpiece. It was a serious and well-considered move, which we made knowing fully well that there could be risks in it.  Our honesty made an impact on the international community. Later, when the bus to Lahore was taken to Kargil, it did not take much time for the world to realise that Pakistan not only violated the Shimla Agreement and the Lahore Declaration, but it also crossed the borders of trust and goodwill.  That is what turned the world's opinion. Pakistan stood completely isolated on the world stage. India received widespread support in the world for the first time.  I do hope that the people of Pakistan too will reflect on these events. We reached out to you with a message of friendship. What did we gain in return? Hundreds lost their lives. Relation severe spoilt. The resources which ought to have been used for economic and social development were instead spent on war.  We need peace in order to raise the standard of living of the people in both countries. For peace, we need trust. Has trust increased on account of all that happened in Kargil. Does the path of armed intrusion lead to friendship?  Terrorists are being trained in Pakistan. Camps are being run for them. Hordes of terrorists are being sent into India. They are killing innocent people. They are targeting women and children. How can meaningful dialogue take place in this atmosphere?  Pakistan must realize that no problem can be resolved if it continues to promote terrorist activities. We shall not let the evil designs of terrorists succeed. Today, Punjab is free of terrorism. The people of Jammu and Kashmir are fed up with terrorism. Even Assam and the North-East are affected.  All of us want peace. People are worried about the future of their children.  Terrorism is a curse on the world. When it is combined with religious extremism, it becomes a graver danger to humanity. All of you are familiar with the saying ~Karela Aur Neem Chadha~ (The bitterness of Karela is further worsened by adding to it the bitterness of Neem.)  In our case, over thirty five thousand of our people have been killed by terrorists. Terrorism has become a big problem in many other parts of the world, too. It is obstructing the path of peace and development. Today, there is a need to mobilise world opinion against terrorism.  Today, on the occasion of Independence Day, India stands with full self-confidence. Our gaze is turned to the future. Our standing in the world has risen. Now, the people are not attracted by the controversies and narrow disputes of yesterday.  Throughout the war in Kargil, I was specially satisfied by two features.  There was no communal tension anywhere in the country. goodwill and brotherhood prevailed everywhere, including in Jammu & Kashmir. This must have despaired those who thought that riots would break out in India as soon as the spark of war is lit. Those who hatched the conspiracy of strife, must have been truly disllusioned. The people of all sections of society worked for India's success in the war. A powerful wave of patriotism traveled everywhere.  When I went to Kargil and met our jawans, I saw our entire country there: soldiers from Nagaland, from Assam, from Tamil Nadu, from almost every state were fighting for the country. There was not the slightest distance between them on account of caste or religion or region.  This is the real India. We must make, their oneness our own. We have to live for this India. We have to work for this India. And, if necessary, we have to lay down our lives for this India, as our brave jawans did.  Kargil has once again shown that whenever our patriotism is aroused, all of us stand as one with full confidence and determination, as a fist clenched in conviction. We face our challenges unitedly. Our adversaries should beware of this.  At the same time, there is an equally important lesson for us. Now that the crisis has been beaten back, do not unclench this fist of unity.  The battle is not over. New challenges are knocking at our doors. The patriotism that coursed through the veins of Indians should be made a permanent feature of our lives.  All of us remember the talisman Gandhiji gave us: when in doubt about what to do, he taught us, think of the least, of the most helpless man you have seen, ask yourself, ~Will this step be in his interest?~ he said, and you will see all your doubts melt away.  Kargil gives us a second talisman: As we contemplate a step, let us ask ourselves: ~Is it worthy of the soldier who gave his life on those mountains? Does the impulse which lies behind it measure up to the spirit which filled that soldier as he fought to protect our Motherland?~  The challenges that confront us cannot be overcome only by the men on the frontiers doing their duty. There is a need for an organized and disciplined nation to stand behind them. ;we must defend our country and develop our society by keeping national interests utmost in our minds. If our economy is not strong, and if we are not self-reliant in important matters of national security, then we cannot successfully face external challenges.  All of us, wherever we may be, whatever work we may be doing, we should discharge our responsibilities well. We must never allow any limb of our nation or society to become weak.  It is clear from the effective way in which we have overcome our challenges and dealt with our difficulties, that we can do anything if we resolve to do it. What is needed is to take a pledge: that whatever we can do, we will now do.  I have a vision of India: an India free of hunger and fear, an India free of illiteracy and want.  I dream of an India that is prosperous, strong and caring. An India, that regains a place of honour in the comity of great nations.  Come, let us build an India in which we have balanced development that benefits all regions and all sections of society. I note with regret that several regions in the country - including the North-Eastern States - have been the victims of unbalanced progress. The nation has an especially pressing obligation to bring the people of the North-East into the developmental mainstream.  Come, let us build an India in which Dalits, Adivasis, and Backward Classes are not only freed from economic deprivation, but also enjoy the fruits of social justice. The path that will take us to this ideal is the path of samata, mamata, and samajik samarasta.  Come, let us build an India in which our nari shakti - our women - are able to realize its full potential - from shaping the future of their families to shaping the future of the nation. It is our collective responsibility to empower them economically, socially, educationally and also politically. In this regard, I would like to see early passage of the legislation to reserve seats for women in Parliament and State Assemblies. We have already seen how women have given an excellent account of themselves wherever they have got an opportunity to serve in panchayats and other local bodies.  Come, let us build an India in which the minorities fully enjoy the fruits of national development, while having full opportunities to contribute to it. our country belongs to all. And all are entitled to equal and fair treatment in the eyes of the law and the Government. India, which is home to the great secular principle of Sarva Panth Samabhav, fully guarantees the religious freedom of all communities. It is a matter of immense pride for India that all the religions of the world have a harmonious co-existence here. Unity in Diversity is our priceless heritage.  It is also a matter of much satisfaction that the past year has seen a record low in communal violence.  India is the largest democracy in the world. The tradition of democracy in our country is very old. When this Century opened, democracy was the preserve of just a handful of countries, and even in them it was limited to small sections of the people. Today there are just a handful who are still out of the pale of democracy. There is scarcely a country whose people do not aspire to it.  Come, let us strengthen Indian democracy. Let us make it an ideal for other countries of the world. Let us transform our political democracy into economic and social democracy.  Come, let us make India a nation of high achievers - in every sphere. In business and economy, in education, in science and technology, in arts and culture, and also in sports. Let us make India synonymous with ~achievement~, achievement of the kind that can be benchmarked globally. All of us are heartened by what our young men and women have achieved in recent times. The success stories of young Indians working abroad are making headlines almost every day. If young Indians can script such shining successes abroad, why shouldn't we create conditions for them to do so right here?  Come let us together build a Parishrami Bharat, a Parakrami Bharat, a Vijayi Bharat.  To realise this vision, let us step out of the swamp of negativity.  Let us not be obsessed with the past. Face the future.  March with confidence towards the goal.  Turn from problems - to solutions.  Today, when the 20th century is coming to an end, and the 21st century is knocking at our doorsteps, let us draw inspiration from our glorious past and resolve to build an even more glorious future.  Come, let us make good use of the natural and human resources of our Motherland, Bharat and make the 21st century, India's century.  We are inheritors of an ageless culture and a proud civilisation. Greatness is our past - and also our future.  Come, let all of us together raise our voice in saying:  Jai Hind,  Jai Hind,  Jai Hind~. ", "2002": "Dear countrymen,  My hearty Independence Day greetings to all of you.  My felicitations,  To the brave soldiers of the three Armed Forces and to all our security forces.  To our hard-working kisans and diligent workers.  I greet our scientists, teachers, and our sisters and mothers whose awakening has unleashed India s Woman Power.  And, dear children, you are the future of our Nation. Lots of love to you, and my blessings.  Members of India s Diaspora, living in distant lands of the world, my good wishes to all of you. You may be far away from India, but you are always close to our hearts.  I wish to congratulate all our sportspersons, who did India proud in the recent Commonwealth Games. In particular, our women who have shown that they are in no way behind men. I am confident that Indian sportspersons will earn similar success in the Olympic Games.  Sisters and Brothers,  It is fifty-five years since we became independent. Today, we pay our homage to all the martyrs of the Freedom Struggle. We bow our heads before Mahatma Gandhi, Netaji Subhas Chandra Bose, and all other great leaders.  We salute our soldiers, jawans of paramilitary forces, and police personnel who laid down their lives in combating terrorism.  Our tributes also to the martyrs who foiled the terrorist attack on our Parliament on December 13.  Terrorism has become a festering wound. It is an enemy of humanity.  Our neighbour claims to oppose terrorism at the international level, but adopts double standards in the context of our region. After facing defeat in wars, it has resorted to cross-border terrorism for grabbing Kashmir.  We wish to state once again that Jammu and Kashmir is an integral part of India. It will remain so.  The world cannot accept that the cruel massacre of the Amarnath pilgrims, or the carnage of innocent women and children at Kaluchak and Kasim Nagar are a part of any ~Freedom Struggle~.  For us, Kashmir is not a piece of land; it is a test-case of Sarva Dharma Samabhava   secularism. India has always stood the test of a secular nation. Jammu and Kashmir is a living example of this. And this itself is Kashmiriyat.  We shall defeat cross-border terrorism in Jammu and Kashmir. This is our resolve.  We wish to have good neighborly relations with Pakistan. The Lahore Journey and the Agra Summit are a testimony to this.  India wants all issues to be resolved peacefully and through negotiations. We are prepared to take some more steps in this direction. However, for this, it is necessary to create a conducive environment.  Infiltration into Jammu and Kashmir continues even today. Those who call the forthcoming elections in the State farcical should not give us lectures on democracy. Let them take a look at their own track record.  How can attempts to flagrantly provoke the people of Jammu and Kashmir to boycott elections create an atmosphere for any meaningful talks. Instead of resolving problems, this will only exacerbate them.  Sisters and Brothers,  I am deeply saddened when I compare South Asia with other parts of the world. When Japan, which was devastated in the Second World War, today stands as one of the front-ranking nations; when the whole of Europe has united, forgetting all the old enmities; why can t we resolve all our contentious issues through talks?  We can. We will.  Why can t we unite and fight against our real enemy, the poverty?  This is a challenge. No one is going to come from outside and meet it for us.  ***  The process of peace and democracy has now arrived at a decisive turn in Jammu and Kashmir, which has been grappling with terrorism.  Elections are going to take place in the State. The dates have already been announced.  I am confident that these elections will be fully free and fair. No one need have any doubts on this score.  I appeal to the people of Jammu, Kashmir, and Ladakh, as also to their representatives to participate actively and in large numbers in the elections and thereby demolish the motivated propaganda being conducted from across the border.  No one will be allowed to create disturbances in the elections in Jammu and Kashmir. All the designs to create an atmosphere of fear will be frustrated.  The people of Jammu and Kashmir want to live in peace. For many many years they have seen and suffered violence and bloodshed. They want to create a future for their children.  My brothers and sisters in Jammu and Kashmir, today is an opportunity when we can together heal these wounds. Together, we can participate in the creation of a happy Jammu and Kashmir.  I would like that no citizen of the State feels alone and helpless. The entire Nation is with them.  I am confident that all the displaced people, including Kashmiri Pandits, will be able to go back to their homes with respect, in the new situation that will be created after the elections.  I wish to assure the people of Jammu and Kashmir that if any mistakes have occurred, we shall make amends. For this, we shall talk to the elected representatives and organizations. Discussions will also take place on the demand for more powers to the State.  ***  The desire for peace is growing in India s North-Eastern States too. The demand for faster economic development is intensifying.  People are realizing the fact that the gun can snatch away life, but it cannot make people s lives better.  Our efforts for permanent peace in Nagaland are progressing towards success. We invite all those who have taken to the path of violence in other North-Eastern States for peace talks.  Sisters and Brothers,  In addition to external difficulties, we also have had to grapple with nature. A large part of the country is reeling under a severe drought. In some places, floods have shown their wrath.  Standing crops are wilting, sown seeds have gone bad. Kisans are concerned. We share their concern.  The Government has taken every possible step to deal effectively with the drought. Our godowns are brimming with foodgrains. We will not let anyone die of hunger.  Relief is being reached to the weaker sections of society by extending the scope of the Antyodaya Anna Yojana. Under the Rs. 10,000-crore Sampoorna Grameen Rozgar Yojana, drought relief programmes are being speedily implemented. Five thousand crore rupees have been given to States to undertake various ~Food-for-Work~ activities.  Prices of essential goods are under control.  But all these are temporary measures.  The Government is now preparing an effective, long-term strategy to protect the country from the curse of drought and floods.  We will make concerted efforts to save every drop of water. We will have to adopt watershed management, rainwater harvesting, and all such techniques.  We will shortly unveil a new initiative, which will be called Pradhan Mantri Grameen Jal Samvardhan Yojana.  We shall soon start three important programmes:  One lakh hand-pumps will be installed in water-scarce areas;  One lakh primary schools in rural areas will be provided with drinking water facilities; and,  One lakh traditional sources of drinking water will be revived.  Dear Countrymen,  With your trust, affection, and support, I am in front of you for the fifth consecutive year on the ramparts of Red Fort.  There is stability in the country today. People want the experiment of coalition governance to succeed.  Democracy has become stronger. Its roots have reached every village and town. After Independence, thirteen elections to the Lok Sabha have taken place. Governments have been formed and changed, but always without any bloodshed and violence.  My Government is committed to carrying out electoral reforms. It is our firm resolve to keep criminal elements away from power.  Dear Countrymen,  Today, India stands proudly on the world stage   tall, self-reliant, and full of self-confidence. Our prestige is on the rise internationally.  It is necessary that we do not overlook our achievements. Undoubtedly, our progress in certain areas has been tardy. We have to honestly introspect on this. For, we have the potential to achieve much more than what we have achieved so far.  Sometimes, we tend to talk about our shortcomings much more than is necessary. This gives rise to disappointment. The Nation s energy dissipates.  On the other hand, the feeling of national pride inspires us to work to achieve more.  We are proud of our kisans. Until a few years ago, we had had to import foodgrains from abroad. Last year, we exported foodgrains worth Rs. 6,400 crore.  We are proud of our scientists and engineers. They successfully launched into space not only Indian satellites, but also satellites of other countries.  We are proud of our entrepreneurs in the computer industry. Could anyone have even imagined that one day, India would earn Rs. 40,000 crore in computer software exports? But it has happened.  Behind these achievements, is the talent, the hard work, and the determination of us Indians. The credit for this goes especially to the youth of our country. Come, let us congratulate our younger generation for this.  Sisters and Brothers,  We have a multi-party system. The race for power is natural in this system. However, this race has to remain within the limits of the ~Nation First~ principle.  We will have to draw a Lakshman Rekha in our political conduct. This must never be crossed for temporary gains.  Today, there is consensus among political parties on issues of national security. Then, why can t we create a similar consensus on certain pressing issues of social and economic development?  We can create this consensus. We must create this consensus.  Take for example, the problems in the power sector. The scarcity of electricity has assumed crisis proportions in many States.  I appeal to all political parties to arrive at a consensus on the minimum agenda for power sector reforms.  However, it is not enough to change the mindset of political parties. It is also necessary to bring about a change in the mindset of the people.  Just think of the extensive theft of power, and of the Rs. 25,000 crore that is lost through it every year. How can this be tolerated?  Today, kisans want quality power; they are willing to pay more if the power supply is uninterrupted. But there should be no interruptions and cuts and no impediments in its transmission to the desired destinations.  Countrymen,  The economic reforms that have been implemented in the past few years are in front of you. An economy of scarcity has been transformed into an economy of surplus.  Today, there are no crowds in front of ration shops.  There are no lines for gas and telephone connections  The queues for kerosene have become shorter.  Prices of vegetables may have risen in rainy season, but we have strived to keep onion prices in check!  Telecom and Internet services are available to more and more people. Their rates too are continuously falling.  Our chief objective of economic reforms has been to remove poverty speedily. We are moving rapidly in this direction. The living standards of the common man are rising. Today, a fan, a TV, a refrigerator, or a scooter can be seen even in poor localities.  My dream is to see that every family has its own house. In the past four years, we have initiated the process of construction of nearly sixty lakh new houses. Of these, 35 lakh houses are in rural areas and eighty percent are for poor families.  I dream of an India in which both the Government and Society are sensitive. Our policies and programmes have been formulated with this end in mind.  Brothers and Sisters,  Faster development of the infrastructure in our country is the need of the hour. We are fully determined to ensure that this happens.  A network of world-class highways is being laid across the country. The National Highways Development Project is being implemented rapidly. Rs. 55,000 crore will be spent on it. This is the biggest and most ambitious road project to be implemented in India after Sher Shah Suri s Grand Trunk Road.  Similarly, the Pradhan Mantri Gram Sadak Yojana, costing Rs. 60,000 crore, will link every village with an all-weather road in five years.  These two road projects are generating jobs for lakhs of people.  Dear Countrymen,  Our aim is to free India from the curse of poverty and unemployment. It is to make India a Developed Nation by 2020.  When this country of one billion people works with a common resolve, then no goal is impossible to achieve.  The Tenth Plan has set the target of eight percent yearly growth in GDP.  We are taking some important new measures for economic and social development. These will be announced separately today.  Sisters and Brothers,  I appeal to you to display the same emotional unity on the issue of National Development as you always do on the issue of National Security.  Come, let us make Development a powerful People s Movement.  For this, it is necessary that everyone rises above casteism and communalism. We will have to leave behind all those things that divide us.  The horrific explosion of communal violence in Gujarat was one unfortunate example of this. There can be no place for such violence in a civilized society.  We must maintain peace, communal amity, national unity and integrity even in the most serious and provocative of circumstances.  It is the responsibility of the Government and Society alike to provide security and equal opportunities for the minorities.  Countrymen,  Come, let us as a nation look ahead, look to the future.  Someone has rightly said:  ~Beeti Tahi Bisar De, Aage Ki Sudh Le~  (Forget what happened in the past, look forward to the future.)  Rather than getting bogged down in the issues and disputes of the past, let us create a new future for ourselves.  All our programmes will succeed and all our dreams for progress will come true only when we strictly adhere to probity and morality in public life.  We will not compromise with corruption at any level. Those who are in high offices should remember that people expect equally high conduct from them.  While on the one hand, there is a need for those in politics and administration to change their behaviour, equally, our citizens need to change their attitude.  Do not talk only of your rights. Remember also your own duties and responsibilities.  The mindset of depending on the Government for every work has to change.  I call upon all citizens and voluntary organizations to come forward for social work.  ***  It is our collective responsibility to ensure that Dalits, oppressed, and people belonging to backward classes enjoy social justice and equality. We do not do them any favour by doing this.  My Government has extended the period of reservations for scheduled castes and scheduled tribes in government service for another ten years. Their opportunities for promotion in government service have also been properly ensured.  These reservations are not a dole, rather they are an instrument for bringing about social equality.  My dear countrymen,  This fifty-fifth anniversary of Independence conveys one more message to us. And that message is that all of us strive to our utmost for the realization of the dream of making India a Developed Nation.  May our goal be the limitless heights of the sky.  May our feet be on the ground.  May our minds be full of unyielding determination.  May our hands be clasped together.  May our resolve be to march together.  If we do this, our victory is certain.  Come, let all of us unitedly affirm this resolve with the victorious salutation of Jai Hind.  Join me in saying thrice:  Jai Hind! Jai Hind!! Jai Hind!!!", "2001": "My dear countrymen,  You just now heard the melodious band of our Armed Forces. I convey my greetings to all of you. We are celebrating the 54th anniversary of our Independence. Today, we pay our respectful homage to the martyrs of the Freedom Struggle. I would like to remember today all the great men and women of our Freedom Movement, especially Mahatma Gandhi and Netaji Subhas Chandra Bose. They inspire and illuminate our march in the new century.  On this occasion, I send my greetings to all the people of Indian origin living in different corners of the world.  This nation of 100 crore people, inheriting a five thousand year old civilization, is today scripting an illustrious chapter in its history.  Dear friends,  Remember the many hardships that we had to go through three years ago in the aftermath of the nuclear tests at Pokharan. Today, those difficulties are receding.  We faced those hardships for the sake of our national security, and we did so successfully. Today our relations with many important countries of the world have grown stronger and deeper. We are engaged in a Strategic Dialogue with them on a regular basis.  India’s prestige has gone up globally.  Sisters and brothers,  We have always been strong votaries of world peace. For thousands of years, we have been chanting the mantra of peace. — Prithvih Shantih, Antariksha Shantih, Vanaspatayah Shantih   — praying for peace on earth, in outer space, and also peace for all the flora and fauna.  Naturally, we have always desired to have peaceful relations with all our neighbours. The entire world knows that India has left no stone unturned to improve her relations with Pakistan. These efforts have been continuing right from the days of Pandit Jawaharlal Nehru. Many Agreements and Declarations were signed. But these have not helped to establish lasting peace.  I, too, attempted to make a new beginning. I went to Lahore for peace.  Yet, despite having signed the Lahore Declaration, Pakistan committed an armed aggression at Kargil. Our jawans, with their bravery and heroism, threw them out of our territory. I pay my tribute to all those soldiers who laid their lives in that conflict. I express my deep sympathies with their families on this occasion.  Despite Kargil and cross-border terrorism, we invited Pakistan’s President General Pervez Musharraf for talks  I told my guest in Agra: ~We have been fighting for 50 years. For how many years more, you intend to fight? This has helped neither Pakistan nor India. Because of the hostile relations, both our countries are spending a lot of their limited resources on wars and for preparing for wars, whereas we ought to be spending these scarce resources on the development of our two countries and to improve the lives of our peoples.~  I had also told him: ~If we have to fight, why don’t we wage a war against poverty, against unemployment, against disease, and against underdevelopment.~  We know that the people of Pakistan yearn for peace with India.  We have to promote cooperation in trade, economics, and in other areas for mutual benefit. We have to encourage greater people-to-people contacts.  Unfortunately, President Musharraf had no interest in improving our relations in all possible areas. He came here with a single-point agenda — to make India accept Pakistan’s terms on Kashmir.  I could not have accepted this condition.  He wanted us to forget the Shimla Agreement and the Lahore Declaration, and begin a new journey from Agra.  I could not have accepted this too.  He kept on describing cross-border terrorism as ~jehad~ and ~freedom struggle~.  There was simply no question of accepting this logic.  As we had expected, there has been a spurt in terrorist activities after the Agra Summit. There have been massacres of innocent people in Amarnath, Kishtwar, Doda, Jammu and yesterday near Ghaziabad.  What kind of jehad is this? What kind of freedom struggle is this? And, for whom is this freedom struggle?  The activities of Pakistan-supported Jehadi organizations are napak (unholy). They are against the tenets of Islam and humanism.  Let no one entertain any delusion that Pakistan can succeed in wresting Kashmir, through jehad and terrorism, what it has failed to get through wars.  As far as the dialogue with Pakistan is concerned, India shall continue to be engaged in this process. Nevertheless, we shall not hesitate in the least to crush Pakistan-sponsored terrorism in Jammu and Kashmir.  Today I wish to tell the people of Jammu, Kashmir, and Ladakh that we feel your pain and agony. We have been making all efforts to remove it.  We shall intensify the efforts that we have been making to bring normalcy to the State and to bring the fruits of development to its people. Panchayat elections have been held in the State recently. The people of the Jammu and Kashmir will elect a new Assembly, after some time. We shall ensure free and fair elections to the State Assembly.  On this occasion, I recall the couplets of the great Shayar-e-Kashmir, Mehjoor. Its gist I would recall here:-  ‘The caste and land of you Kashmiris is the same. Do not unnecessarily let anything create a distance between you. If Muslim is milk, Hindu is sugar. Mix this milk with this sugar’.  This Sufi ideology is the convergence point of Kashmir with the spiritual tradition of India. Kashmiriyat is a fine example of Sarva Dharma Samabhava (secularism). It completely negates the Two-Nation theory. We are indeed proud of this Kashmiriyat.  The situation in the North-Eastern States is a matter of special concern to us. Violence complicates problems; it does not solve them. It has created hurdles in the path of development of the North-East.  Today I would like to reassure my sisters and brothers in the North-East that the comprehensive peace process, that we have begun in the region, will bear desired results.  India is a vast nation. It is multi-lingual and multi-religious. It is full of myriad diversities.  These diversities are not our weakness. Rather, they are our strength. They showcase our cultural richness. In these diversities lie the powerful threads of India’s unity.  Sisters and brothers,  India is one of the ten fastest growing economies in the world. In terms of size, India is counted among the four largest economies of the world.  India has emerged as one of the front-ranking nations in the world in information technology, missile technology, and in many other areas.  When I see young women and men, of the new generation handling high responsibilities with aplomb, my faith in India’s future gets strengthened. It is these people who are making India a better place than before. They are the architects of India’s strong and glorious tomorrow.  Now we can truly take pride in being Indian. Indians can walk with their heads held high in the world.  In spite of the population having more than trebled in the past five decades, we have been able to reduce the percentage of people living below the poverty line.  In the decade of the ‘90s, it has fallen from 36 percent to 26 percent.  I do not claim that we have been able to eradicate poverty as rapidly as we should, or could, have.  But I am confident that abject poverty is on its way out in India.  In the last decade, literacy in India has taken a quantum jump. I am confident that in the current decade, India will more or less become completely literate.  It is true that India’s economy is currently going through a slowdown. But this is a temporary phenomenon.  This is also a global phenomenon, and not limited to India alone.  But there is no need to get too worried on this score, because the fundamental indicators of India's economy are quite strong.  Prices are stable. Inflation is under control. Foreign exchange reserves are at a record high. And, our godowns are bursting with foodgrains.  Because of good monsoon, there are bright prospects of the coming crops on the economic front. Yesterday’s heavy rainfall had cast doubts that the morning today will be full of dark clouds and the earth will be soaked with the rain showers. But, this did not happen. Clouds have dispersed and the sun has come out. We can now forge ahead towards future. Good monsoon has come with promising prospects on the economic front.  We have taken steps to increase investment in all the infrastructure areas, in industries, and in agriculture. We shall soon take more steps in this direction. These will help in bringing the economic slowdown to an end.  In the past few years, natural calamities seem to have resolved to test India. Orissa was hit by a super-cyclone. In Gujarat there was a devastating earthquake. Some parts of the country have faced severe floods, and at some places there is drought. Now, the task of their rehabilitation is taking place on a large scale with the cooperation of all. We thank the foreign countries and are grateful to them for the speed with which they came forward with help. This symbolises that entire humanity is one and if any of its part is suffering, then the entire body feels the pain. All therefore should rush to extend help unitedly. Nevertheless, together we have encountered these crises with great fortitude and solidarity and provided relief to the affected.  We are going to put in place a permanent and institutional structure to effectively deal with such natural calamities.  My dear kisan brothers,  You are the country’s annadata.  With your hard work, you have not only made India self-sufficient in foodgrains, but have produced a big surplus. Scarcity of foodgrains has become a thing of the past now. Earlier, we used to import food. Now, we are an exporter.  Today, the Government’s godowns have a stock of more than 60 million tonnes of foodgrains. We are augmenting the storage capacity.  I am well aware of the many problems that our farmers are grappling with. We have been constantly trying to mitigate them. It has been our endeavour to ensure that the kisan gets fair and remunerative price for his crops.  So far, more than one and a half crore farmers have been given Kisan Credit Cards.  Some people have been expressing apprehensions that cheap farm imports will flood Indian markets because of our commitments to the WTO. These have been proved false.  We are quite capable, depending on our needs, to impose or hike import duties and to check unfair imports. We have, in fact, done so in some cases.  It is true that a new scenario of world trade is emerging. This has presented many challenges to Indian agriculture and to the rest of our economy. We can — and we shall — face these challenges through collective and coordinated action.  I appeal to all our farmers, workers, managers, businessmen, scientists and researchers to prepare our economy to face global competition more vigorously. For this, our agriculture and industries have to constantly improve their quality. They also have to significantly reduce their production costs.  Friends,  This year marks the decade of India's New Economic Policy.  This policy has brought many gains to our economy. At the same time, however, several new problems have also cropped up.  It is true that certain recent developments have highlighted some of the weaknesses in our financial and capital markets. This has made people feel rather worried.  We have taken several steps to remove these weaknesses, and we shall take more steps in the future.  The functioning of the stockmarkets and financial institutions will be reformed to protect the interests of small investors.  Profits earned by hook or by crook cannot be the sole criterion for judging the success of a business. The success of liberalization requires the steady development of a new corporate ethic.  Brothers and sisters,  Some cases of corruption and scandals have surfaced in recent times. We cannot turn a blind eye to corruption, nor can we let corruption proliferate. A corrupt man must receive punishment for his deeds.  I reassure you that corrupt elements will not be able to escape the long arm of the law, irrespective of how high a chair they may occupy. Only yesterday, a new Bill – Lok Pal Bill has been introduced in the Lok Sabha. The Prime Minister has also been included in its ambit, if there are any corruption charges against him. Our Government will not discriminate in any way in this regard and will not hesitate, if need be, in putting to trial any person, however big or powerful he may be. We have already taken strong action in several cases.  At the same time, I wish to state that there is a need to refrain from giving baseless allegations the color of a scandal. I know that most people in our country believe in earning their livelihood by honest means.  Dear Countrymen,  This year marks a decade of New Economic Policy of India. There is no doubt that economic liberalization has benefited India. At the same time, this too is true that the fruits of liberalization have not adequately reached the poor and people living in rural areas. Inequalities have increased.  Therefore, after serious introspection, my Government has decided to give a new pro-poor, pro-village, and pro-employment orientation to our economic policy.  We shall make necessary modifications in the policy to remove regional imbalances and social inequalities.  We are determined to ensure that the new economic policy becomes a promoter of social justice and that its benefits reach our brothers and sisters belonging to Dalit, Adivasi, backward, and most backward sections of our society.  We have unveiled several important schemes towards this end in the past three years. In the same direction, we now propose to take some new measures: -  The Central Government will launch an ambitious new scheme of Rs. 10,000 crore to provide additional and guaranteed employment in rural areas. This centrally sponsored scheme will be called the Sampoorna Grameen Rozgar Yojana. Under this scheme, those who take employment from panchayats to build durable rural assets will be paid wages in cash and in foodgrains. For this, 50 lakh tonnes of foodgrains worth Rs. 5,000 crore will be provided to State Governments every year. All the existing employment schemes of the Central Government will be merged into this mega-scheme. Nearly one hundred crore mandays of employment are expected to be generated through the Sampoorna Grameen Rozgar Yojana.  Our economy shows a strange paradox. Nearly all the savings of our people are deposited in banks. The banks are unable to use these funds fully for developmental projects. On the other hand, the unorganized sector of the economy does not get adequate bank credit. This sector constitutes two-thirds of our economy. The loan repayment record of this sector is indeed better than that of big industries. We are considering some institutional measures to make resources available to the unorganized businesses and industries.  Neither faster development, nor people’s participation is possible without decentralization. Which is why, two important amendments to the Constitution were enacted nearly ten years ago to empower the Panchayati Raj Institutions. However, we have so far not been able to devolve the necessary powers to the Panchayati Raj Institutions to empower them financially and administratively in an adequate manner. The Government will soon initiate a national debate to achieve this important objective, involving all the over thirty lakh elected representatives in Panchayati Raj institutions. We would like the Panchayats to fix their own priorities, prepare their own plans, and to implement them with the participation of the villagers. Towards this end, we shall devise new ways to enable Panchayati Raj institutions and non-governmental organizations engaged in rural developmental activities to avail loans from banks and other financial institutions for specific development projects.  All of us know that democracy and hunger cannot go together. We shall therefore launch a National Nutrition Mission. Under this, subsidized foodgrains will be made available to adolescent girls and expectant and nursing mothers, belonging to below-poverty-line families. Cheaper foodgrains could also be provided to such religious, social, and educational organizations if they so require, that are engaged in mass-feeding programmes for the poor. Friends, India is urbanizing rapidly. As a result, there is a growing shortage of affordable housing for the urban poor. The Government has, therefore, decided to launch Ambedkar – Valmiki Malin Basti Awas Yojana, to benefit especially those belonging to the scheduled castes, scheduled tribes, backward classes, and other weaker sections. The Ministry of Urban Development will give a yearly grant of Rs. 1,000 crore to this project. HUDCO, which will implement this scheme, will make available another Rs. 2,000 crore as a loan amount. There is a shortage of three lakh housing units for the families of the jawans in our Armed Forces. At the present rate of housing construction, it will take thirty years for this shortage to end. We have decided to build these three lakh housing units in the next four years.  I had mentioned, in my Address to the Nation on Independence Day last year, about the Pradhan Mantri Gramin Sadak Yojana. This is now being implemented in almost all the States. So far, the Centre has made Rs. 5,000 crore available for this project. This project would need Rs. 60,000 crore for completion. It is our aim to provide all-weather road connectivity to all villages and hamlets in the country, with a population of more than five hundred, by the end of the Tenth Five Year Plan in 2007. The National Highways Development Project of Rs. 55,000 crore is one of the ambitious projects of independent India. We shall further intensify the work on this project. I am confident that these two major road connectivity programmes would create lakhs of new employment opportunities and also give our economy a big boost.  Our objective is Freedom from Distance. We are, therefore, determined to link all the villages of India not only with good roads, but also with good telecom and Internet services. A lot of progress has taken place in this regard in the past two years. We shall further accelerate this work. Small and cottage industries are a big source of employment. The Khadi and Village Industries Commission (KVIC) alone provides employment to more than sixty lakh people under its various units. It has added six lakh new employment opportunities during the past three years. We shall take many new measures to strengthen the KVIC. We have also launched effective steps to popularize khadi and village industry products in foreign markets. Tourism is a big source of employment generation and foreign exchange earning. Indeed, it is the fastest growing industry in the world today. To achieve this end, we shall unveil a progressive National Tourism Policy before the end of this year.  Friends, our entire society, and especially poor people are fed up with the long delays and other deficiencies in our judicial system. The Government has set up over 1,700 Fast-Track Courts to reduce the mountain of long pending cases. We shall soon take necessary steps to repeal or amend all laws and rules, which hurt the interests of the poor. We shall also review all those procedures and practices, which unfortunately have tended to make the poor targets of harassment by agencies of the Government  The Government is committed to the goal of ~Health For All~. After the unprecedented success of the polio vaccination campaign, the Government has decided to soon start similar mass campaigns against leprosy, tuberculosis, malaria, HIV/AIDS, and other such diseases. In recent years, there has been a great interest, both in India and abroad, in Ayurveda and other Indian systems of medicine. We are considering making available a low-cost kit containing certain traditional medicines and herbal products, which have proved their efficacy over centuries in treating many common ailments. I urge our kisans and pharmaceutical companies to seize this new opportunity created by the growing worldwide attraction for Ayurvedic products and Indian systems of medicine.  We are observing this year as Women’s Empowerment Year. Therefore, we shall impart greater momentum to the implementation of all the programmes aimed at the welfare of our mothers, sisters, and girls. I especially wish to congratulate the Self Help Groups started by women, which have begun a silent socio-economic revolution. There are many success stories in India, and also in the South Asian region, where Self Help Groups using micro-credit from banks have made a significant dent in rural and urban poverty. Therefore, the Government has decided to facilitate the setting up of at least one self-help group in each of the 14 lakh habitations in the country, by the end of 2004.  We have taken yet another major decision for women’s economic empowerment. Over the next three years, all public-sector banks will lend five percent of the net bank credit to women entrepreneurs. This will make Rs. 17,000 crore of bank credit available for women-sponsored businesses.  While launching these new initiatives, we are acutely aware of one fact. Usually, the Government prepares schemes and programmes but finds that the system is inadequate to the task of implementing them in an effective and time-bound manner.  The Government has, therefore, decided to observe the coming year as the Year of Implementation.  Towards this end, we shall constitute a Rapid Action Force to monitor the implementation of various poverty-alleviation and employment generation programmes.  Children are the most precious wealth of our nation. Ten years ago, representing India in the World Conference for Children, I had argued for greater investments for all-round development of children. However, the agencies of the Government alone cannot achieve this. I earnestly appeal to all voluntary organizations, businesses, and common citizens to ensure that we together enable every child in India to develop to their fullest potential.  Next month, there is a special session of the United Nations General Assembly on children. India will reiterate her commitment to children’s welfare at this important forum.  Friends,  There is political stability in the country. There is a thriving democracy. In a big country like ours, there are bound to be small and not-so-small problems. Political opposition is natural in a democracy, but there should be no opposition for the sake of opposition.  There is full freedom in our country for political parties, intellectuals, and the media to express their views. This is, indeed, a matter of pride for us. It is only such freedom that nurtures and strengthens the roots of democracy.  However, freedom comes with responsibility. Our democracy demands of all of us that we discharge our responsibilities conscientiously, and that we respect proper norms.  Brothers and sisters,  We are all citizens of an India that is on her way to attaining greatness. We should have confidence in India’s future. We should have faith in ourselves. We should have trust in our own hands and in our own brains. Trust is a resource. It has been my endeavour and the endeavour of my Government that we nurture mutual trust. Trust should not be broken. Nobody should come in the way of building mutual trust.  It is only on the strength of mutual trust, cooperation, and coexistence that we can create a future of hope for India.  Come, let us together resolve today to build a united, strong, prosperous and a caring India.  Jai Hind!  Jai Hind!  Jai Hind!", "1998": "My dear Sisters, Brothers and Children,  I greet all of you on the occasion of the 51st Anniversary of our country s Independence. Half a century has passed still it appears as if it happened yesterday. Pandit Jawaharlal Nehru had unfurled our beloved tricolour in the blue sky from this very spot for the first time. Since then it has been a tradition to unfurl the National flag from  the historic Red Fort. I had never imagined that I shall have this good fortune one day. It is a symbol of strength and potential of the Indian democracy that the son of a school teacher hailing from the dusty and smoky environs of a village has the privilege of  unfurling the national tricolour from the ramparts of Red Fort on this auspicious Independence Day.  We all know that independence did not come to us easily. On the hand, while tens of  thousands of our countrymen and women suffered in jails during the non-violent freedom  struggle under the leadership of Mahatma Gandhi, on the other hand, thousands of  revolutionaries sacrificed their lives on the gallows. We owe our independence to these   known and unknown martyrs and freedom fighter. Let all of us together pay homage to them and take a pledge that we shall defend our freedom, even if we have to sacrifice everything for this.  Our country has been subjected to foreign aggression. In this short period of 50 years,  we had to face four aggressions. But we have safeguarded our independence and  integrity. The highest credit for this undoubtedly goes to our soldiers. Away from their  homes and dear ones, braving dangers all the time, they guard our frontiers day and  night. This is why we are always reassured about our security. Be it the snowy expanse  of Siachen with minus 32 degree Celsius temperature or the thick forests of the  North-East, the deserts of Kutch or Jaisalmer or the deep waters of the Indian Ocean     our troops are vigilant everywhere. On our behalf I greet all these troops of the Army,  the Air Force and the Navy and other security personnel. While congratulating them we  must say   ~O! Brave Soldiers, we are proud of you!~  The Forces need our support. Our farmers and labour force have strengthened the  second line of defence in the farms, the barns and the factories. We can never forget  this. Lal Bahadur Shastri had said:  Jai Jawan, Jai Kisan    One is incomplete without the other, unfulfilled without the other. I have added a new aspect to this   Jai Vigyan!  Pokhran Test  We can neither develop nor defend the country in the 21st century with the resources of the past century. We have to modernise our forces to enable them to face and danger and safeguard our independence and integrity. With only this aim, we conducted the nuclear tests on the 11th and 13th of May this year. The tests of Pokhran were not  the efforts of just one night. They were the results of years of hard work on the part of  our scientists, engineers, technicians and the defence forces. I have only tried to further the work the foundation of which was credit by Smt. Indira Gandhi. I was only a  means. The credit for this great achievement goes to our talented scientists and the hard work of our defence forces. I wish to heartily congratulate all of them on this auspicious occasion of this Independence Day.  I am even grateful to all of you for extending your full support in this trying hour. With a few exceptions every Indian, wherever he may be living, has welcomed this step. Holding our head high that day we proudly proclaimed   we are Indians . For that day in Pokhran, the might of the Nation manifested itself along with nuclear energy.  I wish to make it clear right now that India has always been an ardent advocate of  peace and will always remain so. We know and want to see weapons for self-defence  only. We would never use atomic weapons for attacking anyone. Hence, we have put a  self-moratorium on any new nuclear tests. We ourselves proclaimed to the world that  we shall never be the first user of atomic weapons. We are doing it neither under pressure nor fear of any one. We are doing it voluntarily because of our firm belief in  world peace and disarmament. Our dream is to see the world free from nuclear weapons and we want to see this dream come true. Initially, some countries did not appreciate  our national security policy needs and doubted our intention. Some of them imposed economic sanctions against us. But now the situation is changing. The world is gradually appreciating the Indian viewpoint. We have been able to make them understand our position. As a result, some of the sanctions have begun to ease. We welcome this changing global attitude.  However, we also want to make one point clear. India is a great country and its people are powerful. The brave people of our country are always ready to face any danger to defend their honour. Our history bears testimony to this. No force on earth can deflect  us from our chosen path. I am saying this not out of arrogance but with humility and self-confidence. We are willing to make any sacrifice to uphold the unity, integrity and sovereignty of our country. We wish to improve relations with our neighbours. We know  that the easiest way to win a war is not to let it happen. We are ready to hold talks with Pakistan on any subject, at any level and at anytime.  You all know that I have taken the initiative during the SAARC Conference in Colombo. I  am somewhat unhappy that we did not get the desired response. Still I have not given  up. I will make another effort at reviving the dialogue during the Conference of the Non-Aligned countries in South Africa at the end of this month.  I believe that all problems of the world can be solved through talks. Therefore whether  it is Pakistan or China, we will endeavour to solve our mutual problems through friendly  talks. In the last few days terrorise activities have increased in Jammu and Kashmir. The massacre in Himachal Pradesh appears to be part of a bigger conspiracy. Such terrorist  activities everyday, from across the border, are like a proxy war. Government has taken  these incidents very seriously. We are facing them with all our might and we will not  rest content until we have defeated these.  Time for Retrospection  Whether in personal or national life, the 51st anniversary is always a golden opportunity  to assess the past fifty years. It is also the time for retrospection and preparation for a  leap into the 21st century. While making an assessment we most often commit mistakes, tend to undertake our achievements and magnify our shortcomings which result in gloom.  Sometimes, I see a growing tendency of pessimism in the country. There may have been aberrations here and there but things have not gone that bad so as to defy solutions. Our scriptures say that only fools indulge in self-praise. But unnecessary self-condemnation is also like suicide. I want that a realistic assessment of the last fifty years should be undertaken.  National Integration and Secularism  When we attained Independence, some Western experts had forecast that we were unfit for being a democracy and did not deserve freedom. They said we would soon disintegrate. But, today, we can say with pride that we have not only safeguarded our integrity and independence but have also shown to the world how the biggest democracy can be governed. Almost all the countries which gained freedom along with us have kept the democratic tradition alive. This is our 12th Lok Sabha and I am the 11th Prime Minister of India. We have seen over the years transformations taking place from  the tiniest village Panchayat to the Parliament. You all deserve credit for this. Your political maturity in all these elections have baffled political pundits. I congratulate you  for this. Our democracy is safe as long as you remain vigilant.  On the occasion of the golden jubilee celebrations of our Independence, the Nation has to address itself to the important fact that Independence, national integration, democracy and secularism are complementary to each other.  We have to remain independent under all circumstances. An essential condition for this is national unity. Democracy is necessary for national unity. Secularism and democracy are inseparable parts of national unity. I and my Government are committed to all these four elements.  We oppose communalism in any form. We will ensure full security of the minorities and  guarantee their participation in development. We should never forget that we are the citizens of one country. The boundaries of this country extend from Ladakh to Nicobar, from Garo Hills to Gilgit. Ours is a country whose civilisation and culture is more than five  thousand years old. Such a big country replete with varieties of language, faith, living and food habits has resolved to achieve social and economic justice within the framework of democracy. Simultaneously, we cannot forget that we have to strive to rid  this democracy of aberrations. Our legislators behave in such a way in legislatures that even a schoolteacher would not tolerate system of Governance through free debate. The opposition has the right to criticise and Government has the right to  plement. The opposition and the Government are complementary to each other and adversaries.  Fearless and impartial voting has to be further strengthened. The electoral system has to be reformed to free it from casteism, violence, money power and other ills so that in the next century our system of governance is further refined.  Title of  Food Providers   Once upon a time, this country was a land of prosperity. The situation deteriorated and we began to be counted among the poor nations of the world. In the past few years our farmers and agricultural workers have worked very hard to make the country self-sufficient in foodgrain production. An army with an empty stomach cannot fight and a hungry nation cannot have a restful sleep. Our farmers have made the country self-sufficient to justify their being called  Food Providers . I can only pray to God that He shower happiness on the  Food Providers .  There is a shadow of sorrow in this happiness. Today the condition of our  Food Providers  has become difficult. I feel very pained that this year in some states some farmers have had to commit suicide because they could not bear the burden of their debts. I offer my condolences to the bereaved families. As a tribute to these farmers I  have taken a decision. The Crop Insurance scheme will be broadened, new crops will be brought within its purview and its geographical reach will be  creased.  A high-powered Commission will be formed to look into the real financial condition of  farmers and to improve their economic condition. I want to assure our farmer brothers who are the backbones of the Nation that they will never suffer under this Government.  Easy to Say, Hard to Achieve  In Orissa, hunger still stalks the people in places like Balangir, Kalahandi and Koraput. It is unimaginable that even 50 years after independence some people are still stalked by  hunger. I have told the Planning Commission that the outlay on the Employment  Assurance Scheme in these areas should be doubled. My efforts will be to ensure that no one dies of hunger. The country has made commendable progress in business, industry and services. Some of our industries are making their mark on the international scene. I congratulate all the workers, employees, managers, industrialists and businessmen for this achievement.  But we know that this achievement is only a stepping stone. It is not the attainment of  the final goal which is to see the rise of India as an economic superpower. I know that saying this is much easier than doing it. For this, We will need to follow the path of hard work, establish high standards and depend on self-reliance. We will have to produce goods of international standard, which can compete in the global markets. Economic reforms will have to be speeded up. But we will not allow others to take undue advantage of our liberalisation. We will implement infrastructure projects with speed.   Swadeshi  does not mean an inward looking policy. The word has become a global village. Each one is dependent on the other. In this open market system we can use our inner strength to stand up to global competition and I have faith that we will.  This 51st Independence Day is being celebrated not only in India but also round the world. Every person of Indian origin in every country is celebrating this sacred occasion with joy and enthusiasm. I give my good wishes to every person of Indian origin round the globe on this occasion. In some countries our brothers and sisters are watching it  live on television.  Non-Resident Indians (NRIs) have brought strength to the economies of the nations where they have settled. Now they have an opportunity to strengthen India s economy. We have floated the Resurgent India Bond (RIB). Non-Resident Indians around the world are taking benefit of this opportunity. So far, the scheme has brought in Rs. 5,000 crore. I am confident that Non-Resident Indians will take further advantage of this scheme.  We will have to solve these problems. I know that all of you, especially our sisters, are feeling the pinch of the rising prices of some commodities. I understand your problem. Nature is to be blamed more for this than the Government. But I know that by saying this your burden will not be lightened. The Finance Ministry and the State Governments  will work together to combat the price rise. I also ask for the cooperation of traders. They should not indulge in hoarding or profit- making. We will not hesitate in taking strong measures against such elements. I know that a number of festivals are coming up in the next few days. My efforts will be able to see that rising prices do not dampen  your festive spirit.  Problem of Corruption  The country faces another problem that of corruption which is eating into the vitals of  the country like cancer. We have decided to fight it. We have begun the fight from the top. I have not even left out the Prime Minister from the ambit of the Lok Pal Bill, which was recently introduced in the Lok Sabha. This has made clear our intentions to fight corruption at the highest level.  Along with this, we wish to fight corruption in the bureaucracy. Very soon, I will initiate action to speed up work in the cell in the Prime Minister s Office (PMO) which is looking into corruption cases against officials. Removal of unemployment is an important pledge in our National Agenda. It is affecting the lives of everyone. Employment is the only way of fulfilling the basic needs of the people. Creation of schemes for total employment is difficult, but not impossible. But basic needs and services will have to be produced by the masses. Science and technology will have to be applied for this.  Government has decided that ten crore people should get employment opportunities over the next ten years. This means that every year one crore people should get employment opportunities. A task force will be set up for this purpose and it will present  its report soon.  Reservation for Women  The status of women is a good indicator to judge the progress of a modern society. We had promised to give women 33% reservation in Parliament and the Assemblies. We are sorry that we have not been able to fulfill this so far. We have already decided to provide free education to girls up to graduation levels. Now we are going to take another major initiative. All girls at the primary level will be provided books ins their curriculum free of cost. This will cost Rs. 550 crore to the Government.  Rajrajeshwari and Bhagyashree Yojana  A new Insurance Scheme,  Rajrajeshwari  will be started to provide women the economic security. Another insurance scheme,  Bhagyashree  will be started for girls. Both schemes will begin on Diwali Day this year. The premium for the scheme will be Re. 1 per month. And the policyholder will be able to get Rs. 25,000 in case of emergency. The full  details will be announced soon.  Speed up Implementation of Reservation in Jobs  Reservation in jobs has already been provided to the Scheduled Castes, Scheduled Tribes and Other Backward Classes. However, implementation of these provisions is very slow. My Government s efforts will be to speed up the implementation process and to fill the reservation quotas as quickly as possible. The administration will be made more sensitive and accountable to these classes.  National reconstruction Force  Youth power is the strength of the nation. It is also the future of the nation. Many  years ago I had read the words of Baba Amte ~Haath lage nirman mey, nahin mangne,  marne.~ (Use your hands to create, not to ask or hit). This is also our wish. The young  girls and boys of India do not have to extend their hands before anyone, nor do they  have to use their hands against anyone. They should only dedicate themselves to the task of national reconstruction.  For this purpose, we have decided to form the National Reconstruction Force (Rashtriya  Punarnirman Vahini) which will involve youth from 18 to 35 years of age. This force will focus on basic services in the rural and agricultural sectors,  rotection of environment, mass movement for population, control, fight against drugs, spread of education, uplift  of dalit and tribal women and in the field of sports, art and culture. These youth will also get honorarium for their work. Initially this scheme will be implemented in some districts and finally will be extended all over the country.  This scheme will be launched on January 12, 1999 which is the Birth Anniversary of  Swami Vivekanand and which is celebrated as the Youth Day. I call upon the young men and women of this country to donate one year of their youth to rejuvenate the nation.  Golden Jubilee Education Development Space  Satellite Scheme  The next millennium is beckoning us. It will be century of Information Technology. The  greatest strength of India is its intellect. India has the third largest trained manpower in  the field of Science and Technology. We will have to tap this strength. My Government  has taken several new initiatives in the field of Information Technology. It is our ambition that the country should become a super power in this field.  Keeping this in view I am announcing a new initiative. Space is a new race an opportunity to look for innumerable possibilities in the coming century. Space technology  has many advantages, which India can utilise to meet the aspirations of its younger generation. On the basis of the slogan  Jai Vigyan , my Government wants to fulfil the dreams of our youth. In this direction we will start programmes on a new satellite named Swaran Jayanti Vidya Vikas Antariksh Upagraha Yojana (Golden Jubilee Education  Development Space Satellite Scheme).  The first satellite of this programme - INSAT 3-B - will be assembled and launched  before August 15, 1999 by the Indian Space Research Organisation (ISRO) within a record time of less than twelve months. Six transponders of this satellite will be available exclusively to execute  Operation Knowledge  which aims to provide computer, internet and computer based education to all the students of the country. All Universities, engineering and medical colleges, research laboratories and other centres of higher learning particularly will be linked to the Information Technology Network  before the next Independence Day. This programme will also fulfil the development related information needs of the states.  Economic and Social Independence  Today 125th birth anniversary celebrations of Maharishi Aurobindo are coming to a close. He visualized the spiritual, moral and cultural renaissance of the country. Today we should pledge to fulfil his dreams.  Bharat Ratna Baba Saheb Ambedkar once said that political freedom is incomplete  without economic and social freedom. Today, on our political Independence Day we cannot forget this moot point. In the half-century gone by, we have been able to keep intact our political independence but could not win the battle of economic and social independence. We have not been able to free the country from the clutches of poverty and unemployment. The stigma of illiteracy could not be erased. The monsters of casteism and communalism still are raising their ugly head. Today on India s 51st Independence Day, let us pledge to win economic and social independence.  Cauvery Accord  In the short tenure of my Prime Ministership, I have made an effort to take everybody along and I have practised the politics of consensus. Take the example of Cauvery. There was dispute for years on sharing of Cauvery water among Karnataka, Tamil Nadu, Kerala and Pondicherry. On some occasions, this dispute took a serious turn. Water is  used to extinguish fire but if water itself is on fire, what could be done! There is a solution. The solution lies in maturity, harmony, tolerance, patriotism and a willingness to keep others  interest in mind. The recently concluded Cauvery Accord epitomises all this.  Is it not surprising that a large amount of water of our rivers flows away into the ocean, while we fight over our share of water? These disputes have been going on for years. This situation has to be changed. Our rivers, which link the states of the country, have to link the hearts of the countrymen too. There is a need to formulate a National Water Policy. We have promised to formulate such a policy. However, it is possible only with everybody s cooperation and patience.  National Agenda for Governance  My Government has been seriously endeavouring to fulfil the promises made in the National Agenda for Governance. Ours is a coalition and such Governments have their own character which has to be faithfully adhered to. We have prepared a common programme that is the national agenda for our alliance. We have kept all contentious issues out of this arrangement. We have always held national interest to be above the party and personal interest.  The country is passing through a transitional phase today. Our political and administrative system is facing a serious challenge. In such a situation every party and every leader has to conduct himself with a sense of responsibility. History will not forgive us for any action which hurts the nation.  The common man should also ponder over the existing political and administrative set  up. We are faced with some basic issues. Are frequent elections ins the interest of the country? Is it the nation s interest to incur heavy expenditures on frequent elections?  No Compromise on Principles in Pursuit of Power  I have been Prime Minister only for five months. We have a very thin majority in the Lok Sabha. I am aware of the limitations of the coalition Government. I am also aware that in today s system an innocent sage can be hanged by the power hungry.  I can assure you that I have never compromised on principles in pursuit of power and I will never do it. Being in power or out of power is the same for me. I had been in opposition for years and faithfully performed my duties. My opponents have also commended it. Today, a poem of Dr. Shiv Mangal Singh Suman comes to mind:  (I am not afraid of victory or defeat; whatever comes my way on the path of duty, I will  accept it as it is and would no task for any favours).  I wish to assure you that till my last breath I will neither ask for favours, nor give up the path of struggle. I only need your support. I only need the blessings of one billion of my countrymen. There comes a moment in life when one stands at crossroads and ponders over the path to take.  (Modesty is being enraged openly and pawn has beaten the queen, should I take one last gambit or leave it all, which path do I take?).  Then I feel that I cannot go into oblivion leaving the challenges behind. I have to struggle. Once again, I reiterate my pledge in your presence from the ramparts of Red Fort.  (I will not accept defeat and will start the struggle afresh. I will write and unwrite my own destiny and sing a new tune).  Thank you very much. Join me in saying:  Jai Hind ", "2000": "Following is the free rendering of the Prime Minister, Shri Atal Bihari Vajpayee's speech from ramparts of the Red Fort on the occasion of Independence Day, here today:      ~My heartiest congratulations to all of you on the anniversary of our Independence. Wherever you may be   at the highest mountain peaks of the Himalayas or on the shores of the Indian Ocean; on the desert sands of Rajasthan or in the green jungles of the North East, may my greetings reach all of you.      Today is also the festival of Raksha Bandhan. The power of friendship can transform even a simple hand-spun thread into an unbreakable relationship. On this auspicious occasion, I extend my good wishes to all of you, especially to all my sisters.      This is the first Independence Day of the new century. While looking back at the century just past, we must work hard to convert the challenges of the new century into opportunities.      We must make our Independence last forever. We must reiterate, today, our resolve to defend our nation.      Today is a day of sacred remembrance. It is a moment for introspection. We offer our heartfelt gratitude to all the known and unknown martyrs. The memory of their martyrdom will forever live on in our hearts. Their sacrifices will always inspire us.      Today, we especially remember Mahatma Gandhiji. He was not only the foremost leader of our Freedom Struggle, but he was also among the greatest personalities of the 20th century.      On today s auspicious day, we extend our greetings to the people of all the countries in the world. We wish that the 21st century would bring the message of peace, fraternity, cooperation, and steady progress for the entire world.      Today, we send our best wishes to millions of Non-Resident Indians and Persons of Indian Origin living in other countries. Wherever they may live, they are always emotionally attached to India. We wish all of them success and prosperity.      Today, I extend my felicitations to the people of the three new States that have found their place on the map of India after the reorganisation of Madhya Pradesh, Uttar Pradesh, and Bihar. We are confident that the new States of Chhattisgarh, Uttaranchal, and Jharkhand will soon earn their rightful place in the Union of India.      We have succeeded in our commitment of creating these three new States. After the formation of these states, we have to work together for their development so that they become shining examples of success.      The new century is a Century of the Youth. India, too, which has lived for thousands of years, has now become a young nation. Nearly seventy percent of our population is less than the age of 35. These young men and women are more ambitious, more aware, and more active than their predecessors. They not only think big, but they also work hard to realise their dreams.      I have full faith in India s youth. It is our responsibility to fully support our young men and women in building a bright future for themselves and their Motherland.      Dear Countrymen, last year when I had addressed you from the ramparts of this very Red Fort, our country was going through an extraordinary situation. The Lok Sabha had been dissolved and fresh elections announced. It was in these circumstances, that we had to face the aggression in Kargil. And India emerged victorious in this war.      One year later, democracy has become stronger in the country. India s international standing has risen. Our voice is being heard attentively in the capitals of the world.      India is on the move. An India full of self-confidence is marching forward on the path to progress.      It is an India that is as determined to win against all adversities as were our brave jawans and airmen who drove back the enemy s forces.      Our hearts are filled with ever-lasting gratitude towards the brave soldiers of the Kargil and all previous wars.      Pakistan would be committing a terrible folly if it thinks that it can secure anything through the undeclared war that it has been waging against India. Kashmir has been an unbreakable part of India, and it will remain so.      Our neighbour must realise that the clock cannot be turned back. I would advise the rulers and also the people of Pakistan to pay heed to the following verse from the lyricist, Sahir Ludhianvi:  ~r150820001.jpg  Gone is that time, gone is that age,  When ~Two Nations~ was the slogan;  Gone are those people   Whose purpose was Partition!  One, now, are all Indians,  One, now, are all Indians,  Oh India. know this!  Oh World, know this!  Oh World, know this!      The 21st century does not permit the redrawing of borders either in the name of religion or on the strength of the sword. This is the age for resolving differences, not for prolonging disputes.      The people of Jammu, Kashmir, and Ladakh are tired of violence and bloodshed. They are craving for peace. We need to apply the salve of brotherhood on the wounded body of Jammu and Kashmir.      That is why, I recently said that India is prepared to apply the balm for Kashmir s agony within the framework of Insaniyat (humanity).      The world knows who has derailed the move to end hostilities and to start the peace process. The world knows who has torpedoed these efforts.      On the one hand, Pakistan says it is willing to participate in talks. On the other hand, it continues to be deeply involved in violence, killings, and cross-border terrorism. Activities of the terrorists and proposals for peace talks cannot go together.      India s willingness and ability to deal firmly with violence, terrorism, extremism, and separatism should not be underestimated.      Dear Countrymen, we have to build a magnificent nation. There is no other country in the world, which is so ancient, so big, so populous, and so rich in diversities; that has preserved its democracy, its unity, and its culture; and that is fast emerging as a modern and prosperous nation.      We have achieved success, too, in this endeavor. Every section of our society has contributed to this success.      In the present times, India is called upon to pursue two major imperatives. These are: Security and Development. They are complementary to each other. Without security, there can be no development; without development, our security is incomplete.      Now we have to make determined efforts to meet the economic challenges before the nation. We have to accelerate and broaden our development process, so that no child of Mother India remains hungry, homeless, unemployed, or is without access to medical care.      We have to reduce regional and social disparities.      We have to make our brethren belonging to Scheduled Castes, Scheduled Tribes, Other Backward Classes, and minorities equal partners in our developmental process.      Therefore, let us together resolve to make this decade, the Decade of Development.      To realise this goal, we have decided to achieve the target of doubling India s per capita income in the next ten years.      Dear Countrymen, to achieve this ambitious target, we have to undertake many important reforms in our economy. At the same time, we need to implement necessary reforms in our administration, our judiciary, in education, and in other areas.      Reforms are the need of the hour. For example, the world has changed much in the last fifty years; and so has India. There have been many far-reaching political and economic transformations throughout the globe.         To reform is to turn the inevitability of change in the direction of progress.      To reform is to improve the life of every citizen.         Take for example, the reforms in the power sector that the Centre and various State Governments are presently carrying out. These will reduce the losses of our electricity boards, stop the theft of power, and ensure adequate availability of power for increasing production and employment.      Similarly, the reforms that we are implementing in the telecom sector will enable us to provide cheaper telephones, mobile phones, and Internet services in all parts of the country.      There is no scope for either apprehension or fear about our economic reforms. I remember that some people had expressed similar fears even during the Green Revolution. These fears later proved to be baseless.      The perspective of our economic reforms is based on our own concept. You know that almost all political parties have, at different times, and in different ways at the Centre and in different States, been adopting the economic reforms programme.      I urge our farmers, workers, other producers, industrialists, and our intelligentsia to contribute to building a consensus in favour of the economic reforms.      In this connection, I would like to express my special appreciation to all the central trade unions. I met their leaders three days ago, and we had a very constructive dialogue. They have withdrawn their proposed nation-wide strike. The interests of our workers will be fully taken into account in the economic reform process.      This year, the Government is going to take many big and important steps to accelerate our economic and social development and bring its benefits to the largest number of people.      I wish to congratulate our farmers for ensuring that we have not faced a scarcity of foodgrains despite a rapidly rising population. Today, there is no shortage of food; rather there is a shortage of facilities to store our food stocks.      We have formulated a National Agriculture Policy for the first time since Independence. This Policy aims to increase agricultural production by four percent every year. Concrete steps would be taken to check the declining investments in the agricultural sector and to facilitate increase in these investments.      For the first time since Independence, the Central Government has devised a well-conceived and time-bound programme for rural roads. This hundred per cent Centrally sponsored scheme, which is called the ~Prime Minister s Rural Roads Scheme~, aims to connect, within the next three years, every village that has a population of more than one thousand, through good all-weather roads. In the next seven years, every village with a population of more than five hundred will be similarly connected. For this project, the Central Government is making a provision of Rs. 5,000 crore in its first year. It will be launched on Gandhi Jayanti this year.      The National Highway Development Project is an ambitious one. A four-lane Golden Quadrilateral connecting Delhi, Mumbai, Calcutta, and Chennai will be ready by 2003. The North-South and East-West corridors will be ready by 2007.      Khadi, village industries, and small-scale industries are the backbone of India s economy. We would like the benefits of economic reforms to reach them too. There will be a national convention of small-scale and cottage industries on the 30th of this month, where we shall announce many important decisions.      In a very short time, India has become a strong power in Information Technology. In software exports alone, India is expected to have exports of more than Rs.2,00,000 crore by 2008. Through this, lakhs of educated persons are likely to get attractive employment opportunities, both in India and abroad.      To reach the benefits of Information Technology to the common people, our Government has taken many important decisions in the last two years, and will take many more in future.      I want to see every school and every village to have access to computers and the Internet in as less time as possible.      We are committed to ensuring that every village and hamlet gets access to clean drinking water in the next four years. This year, the allocation for the scheme has been increased by Rs. 2,000 crore and its implementation will be intensified.      Before the end of this year, the Government will announce an Integrated National Health Policy, the aim of which will be to quickly achieve ~Health For All~. The policy will also ensure that every citizen is provided with primary health care. Ayurveda, Yoga, Unani, Siddha, and Homeopathy will be given their rightful place.      Recently, the rapidly spreading disease of HIV/AIDS has become a grave challenge to our nation. I appeal to all sections of society to fully participate in building awareness about this epidemic. They should also make necessary changes in their behaviour so that this disease can be controlled.      The most valuable investment that we can make in India s future is to ensure that every child gets education. We have decided that by 2010, every Indian child will get education up to class eight. We have launched Sarva Shiksha Abhiyan (Education for All campaign) to achieve this goal. Education until graduation has been made free for women. All poor families should take advantage of this.      Science and technology have become the main engine of economic growth. We should ensure that every vehicle of economic development is equipped with this engine. Towards this end, the Government is taking concrete steps to remove the gap between academia and industry.      Dear Countrymen, a bright future is knocking at India s door. We can, however, realise this future to the extent that we are able to further strengthen our national unity, secularism, social goodwill, and our democratic system.      India is a land of diversities. We have, in ample measure, geographical diversities; linguistic diversities; religious diversities; and diversities in customs and traditions. Despite these diversities, or perhaps because of them, India has always remained united.         We are one in many, and many in one. The whole world is amazed at how India has successfully sustained this magic not just today, but for many millennia.      This may be magic for the rest of the world; but for Indians, it is life itself.      Religious intolerance and hate have never been part of India s liberal culture. I appeal to the people of all faiths and castes not to create imaginary enemies, and not to resort to the path of using the sword that inflicts wounds on oneself.      Recently, a few unfortunate incidents have spoiled communal peace and goodwill, in some places. The Government will not tolerate the activities of any organisation that spreads communal discord or incites violence.      As Dr. Babasaheb Ambedkar said, our independence is incomplete without social justice. In the new century, India needs more social justice. However, that kind of social justice (Samajik Nyay) is needed which also promotes social harmony (Samajik Samarasata).      The policy of reservations is one of the important guarantors of social justice for Scheduled Castes, Scheduled Tribes, and Other Backward Classes. The problem of backlog in reservations was persisting for some time. Recently, we amended the Constitution and solved this problem.      Women are the backbone of our social system and culture. Our dreams of India s future can only be realised if our women are educated, are made economically prosperous, are empowered politically, and are enabled to play a bigger role in society.      We have promised to provide reservations to women in the Parliament and the State Legislatures. There is now a need to quickly bring about a consensus to implement this revolutionary idea. I have had several opportunities to meet many women who have become members and chairpersons of panchayats and municipalities by winning from reserved seats. They have, through their performance, proved that they are not second to men, either in the democratic process or in administration.      The North-Eastern States have a special place in the nation s life and in India s development. The implementation of developmental projects and programmes has been suffering from many hurdles. Now, a special cell has been created in the Prime Minister s Office to remove these hurdles and speed up the developmental process. This cell will closely monitor the developmental works in the region. There has been an improvement in the situation, thanks to the cooperation of the people and State Governments of this region.      It is sad that the biggest impediment to faster development in the North-East has been the extremist organisations that are fomenting violence and trouble in the region. I appeal to the leaders and followers of these organisations to give up this dangerous and futile path. The Government is presently engaged in talks with some organisations in the region so that peace and development can be restored in the North-East. I am confident that these efforts will bear fruit.      India is a Union of States. Our States have an important role to play in ensuring that the fruits of development reach every Indian home. We are committed to decentralisation of power. We have decided to give our States more financial and administrative powers. We would like our Panchayati Raj institutions to also benefit from decentralization of power, so that their functioning becomes more efficient and effective. We have taken concrete steps in this direction.      In the last two-and-a-half years, we have made continuous efforts to increase dialogue and coordination between the Centre and the State Governments. All States have contributed to this process. This has improved cooperation and concord between the Centre and the States. Consequently, there has been an increasing convergence in our viewpoints and goals. For this, I thank all the State Governments and their Chief Ministers.      We shall intensify our campaign against corruption in high places. Our country cannot make expected progress in development without probity in administration and in public life.      One of the big failings in our national life has been that people expect the Government to solve even those problems, which they could easily resolve through their collective efforts. The Government, after all, has limited resources. In addition, experience has shown us that, those programmes which are implemented without people s participation, rarely yield the expected results.      Let me illustrate. Be it population stabilisation or dealing with natural calamities, conserving water and electricity, or keeping our public places clean and beautiful all these initiatives can succeed only when our citizens participate enthusiastically and in an organised manner.      Dear Countrymen, on the first Independence Day of the 21st century, let us draw inspiration from all the good and glorious aspects of our past. However, let us not become obsessed with the past.      I have been emphasising repeatedly that India should turn its attention to the challenges and opportunities of the future. We should not be stuck in the contentious issues of the past.      Come, let us look to the future. We have to create a prosperous, self-reliant, and self-confident India. Indeed, we have already embarked along this path. We will march further in this direction. We are being counted among the ranks of successful nations.      We must not stop. Rather, we must step up the speed of our journey.      I call upon our farmers, workers, artisans, employees, youth, and, indeed, all our citizens, to make their contribution to a happy and prosperous India.      I ask our entrepreneurs to hoist the flag of their capabilities and prowess and demonstrate to the rest of the world that Indian industrialists are second to none in any competition.      I appeal to the Non-Resident Indians to contribute their fullest to this momentous task.      I exhort our scientists and engineers that they scale new heights of knowledge and science to earn a bright name for themselves and their country.      I appeal to India s sportspersons that they take our tricolor to triumphant positions in the arena of international sports.      The entire nation sends its best wishes to our sports contingent that is taking part in next month s Olympic Games at Sydney.      Come, let all of us contribute our mite to the creation of a Parishrami Bharat (industrious India), Parakrami Bharat (achieving India), and a Vijayi Bharat (winning India).      Our motto for all ages has been:  ~r150820002.jpg  Let us walk together  Let us speak in one voice  Let our hearts beat together      In other words, let us march forward united  all of us together, and taking everybody together.      Let us make the 21st Century, India s Century.      This is our resolve. This is our aspiration.      Thank you.      Jai Hind! ", "2003": "Dear countrymen,  My hearty greetings to all of you on the sacred occasion of our Independence Day.  Each year on this day, we gather at the Red Fort and unfurl our beloved Tricolor. The Tricolor is a symbol of our freedom, of our self-respect, and of sacrifices and martyrdom.  People belonging to the older generations would certainly remember the time when young boys and girls would form themselves into small groups, take the flag in their hands, and go around villages and city streets singing, Vijayi Vishwa Tiranga Pyara, Jhanda Uncha Rahe Hamara. (May our beloved and victorious Tricolor fly high in the world.)  Today we bow our heads in homage to the memory of all the leaders, fighters, and martyrs of our Freedom Struggle.  My greetings to all the jawans of the three Armed Forces and to the security personnel. We gratefully remember those brave soldiers who laid down their lives while guarding our frontiers or in the battle against terrorism.  This year the festival of freedom has arrived bringing the message of good rains in most parts of the country. We hope that the areas, which have not yet received adequate rainfall, would do so.  The last year went by in grappling with the crisis of drought. We assisted all the drought-hit areas to the fullest extent, sent adequate foodgrains there, and ensured that there was no hunger anywhere. We also took care of the mute cattle.  Felicitations to our farmers, who with their hard work, have filled the granaries in the country.  Felicitations to our industrious workers, skilled managers, and far-sighted businessmen, whose successes have attracted the attention of the entire world. Today, India s economy has grown to be the fourth largest in the world.  Greetings to all scientists, teachers, litterateurs, artistes, and to dear children.  Felicitations to all the people of Indian origin living abroad. They have made a remarkable contribution to raising India s stature in the world. We are proud of them.  Today, we offer our salutations to Mother India, whose children we all are. Whatever be our religion, caste, region, or language, we all are one. This unity is our strength.  We should cherish the diversity that underpins this unity. But we must, under all circumstances and at any cost, keep our national unity and integrity intact. This is the most important message of Independence Day.  Sisters and brothers, this is the sixth consecutive time that I have been speaking to you from the ramparts of this historic Red Fort. This has been possible only because of your affection and support.  The dream of India as a great nation, which we had seen during the Freedom Struggle, continues to inspire us even today. To some extent, this dream has been realized. Yet, a lot more remains to be accomplished.  Despite all the hardships, and braving all the challenges in these fifty-six years, India is standing in the world with her head held high.  The nation s security is supreme to us. India cannot be dependent on others for her security. Therefore, the first act of my Government five years ago was to make India, for her self-defence, a nuclear weapons state.  The world is changing. New challenges are emerging before us. We have to make India stronger both economically and socially.  In the past five years, India s prestige in the world has gone up, thanks to our pro-active foreign policy. The international community s way of looking at us has undergone a big change. The world is now recognizing India:  As the world s largest democracy; As an emerging global economic power; As the confluence of a modern nation and an ancient civilization; As a powerful country, dedicated to the ideal of peace. Sisters and brothers, it is our policy to establish friendly and cooperative relations with all our neighbors. We believe in resolving all disputes peacefully. Our frequent initiatives to normalize relations with Pakistan are not a sign of our weakness; rather, they are an indication of our commitment to peace.  In recent months, there has been some progress in normalizing relations with Pakistan. Nevertheless, terrorist activities are still continuing. The test of our neighbour s sincerity lies in whether he is prepared to stop cross-border terrorism totally.  We hope that Pakistan abjures its anti-India outlook. The people of both countries wish to live in peace.  I have been telling our Pakistani friends that we have spent fifty years fighting. How much more blood is yet to be spilt? The two of us need to fight against poverty, against unemployment, and against backwardness.  We should increase trade and economic links between our two countries. When we share a two thousand kilometer long border, it makes no sense for us to trade via a third country.  Let people travel to and fro. Let more and more elected representatives visit each other s country. Let us expand bilateral cultural relations.  Let us open some new doors, new windows, and new light-holes in the walls that divide us.  The love that the two-year-old girl Noor from Lahore received in India carries a message, which our friends in Pakistan should understand.  On the occasion of Independence Day of both our countries, I invite Pakistan to walk together with India on the road to peace. This road is decidedly bumpy. There are even mines strewn along this path. Yet, once we start walking, we will find the hurdles getting out of our way.  I had gone to Srinagar a few months back. I m going there again at the end of this month. The atmosphere there is changing.  Last year, from the ramparts of this very Red Fort, I had declared that elections in the State would be held on time, and that they would be free and fair. Not everybody believed in it then. But, we fulfilled our promise.  The free elections there have yet again demonstrated the fact that the people of Kashmir have rebuffed terrorism from across the border.  The people of Jammu, Kashmir and Ladakh have faith in democracy. They want peace. They would like to see happiness return to their lives.  Those people who, while talking about Kashmir, advocate the right to self-determination, wish to divide India on communal lines for the second time. They will not be allowed to succeed in this.  This year, more than one lakh tourists went to Kashmir. There was a large turnout of pilgrims going on the Amarnath yatra. Nearly six thousand students from different parts of India are today studying in Kashmir. Next week, we shall launch mobile telephone services in the State.  The knotty issues in Jammu and Kashmir can be unraveled only through dialogue. We shall take forward the efforts that have been initiated in this direction. People who have been uprooted have to be resettled in their homes.  Dear Countrymen, the progress that India has made in recent years has given me new hope and confidence.  An India, which was used to borrowing from abroad has started lending to others. An India that was perennially troubled by a paucity of foreign exchange, has today accumulated nearly US $ 100 billion of foreign exchange reserves. The prices of essential commodities are under control. There is no shortage of anything in the market. Poverty is declining. It is our resolve to eradicate it faster. There are no waiting lists now for telephone or gas connections. The number of mobile phone users has gone up from 8 lakh to 1.5 crores. In the coming year, 1.5 crore more mobile customers will be added.  We are all aware of the poor condition of our roads. Even fifty years after Independence, there were nearly two lakh villages, which were unconnected by proper roads. For the first time, the Centre has started the Pradhan Mantri Gram Sadak Yojana to connect them with good roads.  In the first five decades of Independence, only 550 kilometers of four-lane highways were built. In other words, only 11 kilometers a year. Now, we will build 24,000 kilometers of highways at the rate of 11 kilometers a day.  The Rs. 54,000-crore National Highways Development Project is progressing rapidly. Three lakh people are working on it everyday. Next year, this number will go up to six lakh per day.  Lakhs of young Indians have got attractive employment in the field of computers. Sitting in our cities, they are providing services to hospitals, factories, and offices in various countries. Software exports have zoomed from Rs. 8,000 crore to nearly Rs. 50,000 crore.  Our country is now ready to fly high in the field of science. I am pleased to announce that India will send her own spacecraft to the moon by 2008. It is being named Chandrayaan I.  We have increased the amount of lending to agriculture and related sectors. Interest rates have been reduced. We shall soon constitute a National Kisan Commission to encourage new experiments in farming, promote investments in agriculture, and study the various problems faced by our farmers.  The Green Revolution and the White Revolution of previous decades have imparted much strength to Indian agriculture. Now India needs a new revolution   the Food Chain Revolution. Its aim is to achieve a doubling of the average income of the Indian farmer by 2010. An important part of this revolution is to reduce wastage of foodgrains, fruits and vegetables worth thousands of crores each year.  Based on the success of Kisan Credit Cards, we have decided to provide credit card facility to all eligible artisans, weavers, and fishermen. The rate of interest on loans given to them will be reduced to 9 percent a year. A contributory insurance scheme will also be started for their benefit.  Under the Antyodaya Anna Yojana, 1.5 crore poorest families in the country are being given 35 kilos of foodgrains each month at the rate of Rs. 2 a kilo of wheat and Rs. 3 a kilo of rice. Never before were foodgrains provided at such cheap prices. This is the largest food security program in the world.  With the launch of the Sarva Shiksha Abhiyan, no child, especially the girl child, will be deprived of primary education. To implement this program effectively, 2.5 lakh new teachers will be appointed this year itself.  The Mid-Day Meal Scheme for children up to class five is going on in some States. Now, we have decided to run it throughout the country. Later, this will be extended to students up to class ten. This National Program will be known as ~Akshaypatra~. I appeal to voluntary organizations, religious establishments and women s self-help groups to come forward to implement this program in an effective way.  I know what people in under-developed States have to suffer due to the lack of good hospital services there. Therefore, under the Pradhan Mantri Swasthya Suraksha Yojana, six new hospitals with modern facilities, like those available at AIIMS in Delhi, will be established in backward States in the next three years.  Friends, for decades a debate was going on about a project to link our rivers, as a way of freeing India from the curse of floods and droughts. Now we have taken up this challenge. I am pleased to inform you that work on two river-linking projects, with the cooperation of State Governments, will be taken up before the end of this year. We will mobilize necessary resources for these projects.  Never before had housing construction taken place at the kind of speed witnessed in the past five years. Never before were housing loans available at such low rates as now. Lakhs of people have got employment in the housing sector.  India has limitless potential in tourism. Take the case of this historic Red Fort itself. It has been taken up for comprehensive restoration for the very first time in its 350 years. I can see that a beautiful garden is coming up in the ground in front of me. It can be befittingly called the ~August 15 Park~.  I would like you too to emulate this example by undertaking such beautiful projects for the conservation of heritage in your own village or town.  The over-riding objective of our policy of economic reforms is just this: We want to create a dynamic economy that not only succeeds against global competition, but is also caring and compassionate towards the poor and the neglected.  We express our condolences for those who have become victims of untimely death in recent mishaps and natural calamities.  Sisters and brothers, the hands of young Indians are today scripting India s bright future. An ancient nation with a history of several thousand years has once again become a Young Nation and is all set to create a new history.  Today, in this nation of a 100 crore people, 60 crore are less than thirty years old. This generation is better educated than any generation in the past, and more ambitious than any generation in the past. It is a generation that has made up its mind not to fall behind anyone in the world in this age of competition.  Today, the doors of opportunity are opening up for our young people all over the world. These opportunities will only increase in the coming years and decades. Therefore, we should educate our youth in science, technology and other new disciplines from now itself.  I appeal to all, that we listen to the heartbeats of this Young India; that we understand the dreams of this Young India; that we encourage this Young India in every way possible; and, that we give proper guidance to this Young India.  Countrymen, today there is a paramount need that we maintain peace in our society and strengthen the bonds of brotherhood. Development requires peace, goodwill and mutual cooperation. Those who wish to divide the society on the basis of religion, caste or community are doing harm to the country.  India is a multi-religious nation. It is against both its nature and culture to practice discrimination or to do injustice to anybody on the grounds of faith. We should always care for the minorities and be attentive towards their welfare.  Peace talks in the North-Eastern States are yielding positive results. The hands that took up the gun now wish to participate in the development of their region. The Government is ready to welcome them.  Friends, it is our responsibility   the responsibility of the Government as well as of the society   that we provide equal opportunities to our brethren belonging to the Scheduled Castes, Scheduled Tribes and Backward Classes and make them partners in the system. To ensure that economic and social justice fully reaches them is not only our Constitutional duty but also our moral obligation.  We have removed the difficulties that had cropped up in the proper implementation of the policy on reservations. Untouchability in our society is on the decline. However, we have to completely remove this blot.  We have established a new ministry for the development of Adivasis. We have also set up a separate Commission for them. For the first time in fifty years, the list of Scheduled Tribes has been revised and over a hundred new communities have been added to the list.  Friends, after the experience so far, I have come to the conclusion that there is an imperative need for greater commitment and accountability in our system of governance, which has the responsibility of implementing policies and decisions. There is delay in government offices even for getting the right work done. Delays breed corruption.  My Government is prepared to fight corruption at all levels. We have decided to enact the Lok Pal Bill, which had been pending for several decades. In spite of opposition from some people, I have personally brought the Prime Minister within the ambit of its investigation, so that you can even book your Prime Minister if he commits any wrong.  Stringent steps are being taken against economic offenders.  Sisters and brothers, the Government of the National Democratic Alliance has completed five years. All the previous experiments in running coalition Governments at the Centre had failed. We have succeeded.  Today there is a tremendous hunger for development among the people. They want such a stable government which is determined to improve their living conditions and also capable of doing so.  In our polity today, there is, on the one hand, a growing trend towards wanting to work together, but, on the other hand, there is also a scenario of disarray.  Our States have governments of different political parties. The Centre has established cooperative relations with them. Political discrimination on account of ideological differences is unacceptable to us.  The proposal to reserve 33% seats for women in Parliament and State Legislatures, as a means of women s empowerment, has now become a national resolve. Today, there are over 10 lakh women members in our panchayats and municipal bodies. I congratulate them for their good work.  However, it is regrettable that it has become difficult to pass the Bill for Women s Reservation in its original form because of a lack of consensus in Parliament.  Now a new proposal has been brought forward that seeks to create 33% double- member seats, in which one of them is reserved for women. This is a practical suggestion. All the supporters of women s reservation should consider it with a positive outlook. If there is any other suggestion on which a consensus is possible, the same should be implemented. There should be no further delay in realizing this goal, for which our sisters have been waiting for a long time.  Dear Countrymen, today the nation is at such a turning point from where it can take a big leap forward. The yearning to achieve the lofty vision of making India a Developed Nation by 2020 is gathering strength all over the country.  In just one generation, India can be liberated from the curse of poverty, unemployment and underdevelopment. This is not a daydream. It can be turned into reality. Many countries in the world have demonstrated it.  Look behind a little. India has marched forward by overcoming many a formidable crisis. Today, when the era of resurgence has arrived, why should there be any doubt in anyone s mind?  What is needed is only this:  That all of us move together. That all of us move with discipline. That we adopt a new work culture. That we work with a long-term perspective. When this ancient and great nation combines talent and hard work, and strives its utmost in pursuit of a common vision, it will certainly succeed in building a bright future for itself.  Nearly 40 years ago I had written a poem, from which I would like to present a few lines to you.     Together, we have to march  Obstacles will come, let them.  Dark clouds of apocalypse will gather, let them.  Even if embers smolder under our feet,  Or flames rain over our heads,  Smilingly, we shall light the fire  With our own hands, and burn,  But together, we have to march.   In laughter or in grief, in hurricanes,  In immortal sacrifices beyond count,  In greens or in ruins,  In insults or in accolades,  In pain, too,  We have to thrive  Heads held high, hearts swelled with pride.  Together, we have to march.  Thank you.  Sisters, brothers and dear children, join me in saluting:  Jai Hind! Jai Hind! Jai Hind!~"}